## dev: database-tools
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 6 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                            NAME                            |
|----------|------------------------------------------------------------|
| recreate | `null_resource.build_blazer_docker_image[0]`               |
|          | `null_resource.lambda_repo_clone[0]`                       |
| update   | `aws_db_instance.database-tools`                           |
|          | `aws_iam_policy.blazer_exection_role_parameter_policy`     |
|          | `aws_iam_policy.blazer_task_role_policy`                   |
|          | `aws_ssm_parameter.db_tools_environment_variables`         |
|          | `aws_ssm_parameter.notify_o11y_google_oauth_client_id`     |
|          | `aws_ssm_parameter.notify_o11y_google_oauth_client_secret` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.blazer_exection_role_parameter_policy_actions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "blazer_exection_role_parameter_policy_actions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:800095993820:parameter/BLAZER_DATABASE_URL",
              + "arn:aws:ssm:ca-central-1:800095993820:parameter/notify_o11y_google_oauth_client_id",
              + "arn:aws:ssm:ca-central-1:800095993820:parameter/notify_o11y_google_oauth_client_secret",
              + "arn:aws:ssm:ca-central-1:800095993820:parameter/sqlalchemy_database_reader_uri",
            ]
        }
    }

  # data.aws_iam_policy_document.blazer_task_role_actions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "blazer_task_role_actions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:800095993820:parameter/BLAZER_DATABASE_URL",
              + "arn:aws:ssm:ca-central-1:800095993820:parameter/notify_o11y_google_oauth_client_id",
              + "arn:aws:ssm:ca-central-1:800095993820:parameter/notify_o11y_google_oauth_client_secret",
              + "arn:aws:ssm:ca-central-1:800095993820:parameter/sqlalchemy_database_reader_uri",
            ]
        }
    }

  # aws_db_instance.database-tools will be updated in-place
  ~ resource "aws_db_instance" "database-tools" {
      ~ backup_retention_period               = 0 -> 7
      ~ backup_window                         = "07:26-07:56" -> "02:00-04:00"
      ~ deletion_protection                   = false -> true
        id                                    = "db-JQEN2E76PEWW4TCBSPLQXNEZLE"
      ~ password                              = (sensitive value)
        tags                                  = {
            "CostCenter" = "notification-canada-ca-dev"
        }
        # (66 unchanged attributes hidden)
    }

  # aws_iam_policy.blazer_exection_role_parameter_policy will be updated in-place
  ~ resource "aws_iam_policy" "blazer_exection_role_parameter_policy" {
        id               = "arn:aws:iam::800095993820:policy/blazer_exection_role_parameter_policy"
        name             = "blazer_exection_role_parameter_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:800095993820:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:800095993820:parameter/notify_o11y_google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:800095993820:parameter/notify_o11y_google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:800095993820:parameter/BLAZER_DATABASE_URL",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.blazer_task_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "blazer_task_role_policy" {
        id               = "arn:aws:iam::800095993820:policy/blazer_task_role_policy"
        name             = "blazer_task_role_policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssmmessages:OpenDataChannel",
                          - "ssmmessages:OpenControlChannel",
                          - "ssmmessages:CreateDataChannel",
                          - "ssmmessages:CreateControlChannel",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:800095993820:parameter/sqlalchemy_database_reader_uri",
                          - "arn:aws:ssm:ca-central-1:800095993820:parameter/notify_o11y_google_oauth_client_secret",
                          - "arn:aws:ssm:ca-central-1:800095993820:parameter/notify_o11y_google_oauth_client_id",
                          - "arn:aws:ssm:ca-central-1:800095993820:parameter/BLAZER_DATABASE_URL",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.db_tools_environment_variables will be updated in-place
  ~ resource "aws_ssm_parameter" "db_tools_environment_variables" {
        id              = "BLAZER_DATABASE_URL"
      + insecure_value  = (known after apply)
        name            = "BLAZER_DATABASE_URL"
        tags            = {
            "CostCenter" = "notification-canada-ca-dev"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.notify_o11y_google_oauth_client_id will be updated in-place
  ~ resource "aws_ssm_parameter" "notify_o11y_google_oauth_client_id" {
        id              = "notify_o11y_google_oauth_client_id"
      + insecure_value  = (known after apply)
        name            = "notify_o11y_google_oauth_client_id"
        tags            = {
            "CostCenter" = "notification-canada-ca-dev"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.notify_o11y_google_oauth_client_secret will be updated in-place
  ~ resource "aws_ssm_parameter" "notify_o11y_google_oauth_client_secret" {
        id              = "notify_o11y_google_oauth_client_secret"
      + insecure_value  = (known after apply)
        name            = "notify_o11y_google_oauth_client_secret"
        tags            = {
            "CostCenter" = "notification-canada-ca-dev"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # null_resource.build_blazer_docker_image[0] must be replaced
-/+ resource "null_resource" "build_blazer_docker_image" {
      ~ id       = "7921221492906606942" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2024-09-09T16:14:36Z" -> (known after apply)
        }
    }

  # null_resource.lambda_repo_clone[0] must be replaced
-/+ resource "null_resource" "lambda_repo_clone" {
      ~ id       = "5737430860981954794" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2024-09-09T16:14:35Z" -> (known after apply)
        }
    }

Plan: 2 to add, 6 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_db_instance.database-tools"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.database-tools-rds-subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.blazer_exection_role_parameter_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.blazer_task_role_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.blazer_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.blazer_execution_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.db_tools_environment_variables"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.notify_o11y_google_oauth_client_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.notify_o11y_google_oauth_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.sqlalchemy_database_reader_uri"]

33 tests, 19 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
